**Author:** Kayla Bandy  
**Date:** 12/6/22  
**Assignment:** Week 12  
**Program:** WK12Bandy_SQL2.ipynb  
**Description:** Notebook for textbook exercise 17.1, to complete five exercises.  
A. Select all authors' last names from the authors table in descending order.  
B. Select all book titles from the titles table in ascending order.  
C. Use an inner join to select all the books for a specific author. Include the title, copyright year, and ISBN. Order the information alphabetically by title.  
D. Insert a new author into the authors table.  
E. Insert a new title for an author. Remember that the book must have an entry in the author_ISBN table and an entry in the titles table.

In [1]:
#Import needed libraries for SQL and dataset manipulation
import sqlite3
import pandas as pd

In [2]:
#Create connection with existing database file, books.db
connection = sqlite3.connect('books.db')

In [3]:
#Set option
pd.options.display.max_columns = 10

#### A. Select all authors' last names from the authors table in descending order.

In [4]:
#Select statement
pd.read_sql("""SELECT last 
            FROM authors 
            ORDER BY last DESC""",
            connection)

     last
0    Wald
1   Quirk
2  Deitel
3  Deitel
4  Deitel

#### B. Select all book titles from the titles table in ascending order.

In [5]:
#Select statement
pd.read_sql("""SELECT title 
            FROM titles 
            ORDER BY title""",
            connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

#### C. Use an inner join to select all the books for a specific author. Include the title, copyright year, and ISBN. Order the information alphabetically by title.

In [6]:
#Select statement
pd.read_sql("""SELECT title, copyright, c.ISBN
            , a.first AS 'Author First', a.last AS 'Author Last'
            FROM authors a
            INNER JOIN author_ISBN b ON a.ID = b.ID
            INNER JOIN titles c ON b.ISBN = c.ISBN
            WHERE first = 'Abbey' AND last = 'Deitel'
            ORDER BY title""",
            connection)

,title,copyright,isbn,Author First,Author Last
0,Internet & WWW How to Program,2012,0132151006,Abbey,Deitel
1,Visual Basic 2012 How to Program,2014,0133406954,Abbey,Deitel

#### D. Insert a new author into the authors table.

In [7]:
#Create cursor from the connection
cursor = connection.cursor()

In [8]:
#Insert statement
cursor = cursor.execute(""" INSERT INTO authors (first, last)
                        VALUES('J.K.', 'Rowling')""")

In [9]:
#Select statement to check what was inserted
pd.read_sql("""SELECT *
            FROM authors""",
            connection)

   id      first     last
0   1       Paul   Deitel
1   2     Harvey   Deitel
2   3      Abbey   Deitel
3   4        Dan    Quirk
4   5  Alexander     Wald
5   6       J.K.  Rowling

#### E. Insert a new title for an author. Remember that the book must have an entry in the author_ISBN table and an entry in the titles table.

In [10]:
#Reuse the cursor from Part D
#Insert statement into author_ISBN table
cursor = cursor.execute(""" INSERT INTO author_ISBN (id, isbn)
                        VALUES(6, '0439708184')""")

In [11]:
#Insert statement into titles table
cursor = cursor.execute(""" INSERT INTO titles (isbn, title, edition, copyright)
        VALUES('0439708184', 'Harry Potter and the Philosopher''s Stone', 1, '1998')""")

In [12]:
#Select statement to check what was inserted
pd.read_sql("""SELECT title, copyright, c.ISBN, a.ID as 'Author ID'
            , a.first AS 'Author First', a.last AS 'Author Last'
            FROM authors a
            INNER JOIN author_ISBN b ON a.ID = b.ID
            INNER JOIN titles c ON b.ISBN = c.ISBN
            WHERE title LIKE 'Harry%'
            ORDER BY title""",
            connection)

,title,copyright,isbn,Author ID,Author First,Author Last
0,Harry Potter and the Philosopher's Stone,1998,0439708184,6,J.K.,Rowling

In [13]:
#Close the connection/close the database file
connection.close()